In [1]:
import pandas as pd

C:\Users\wq\AppData\Local\Temp\ipykernel_17920\4080736814.py:1: DeprecationWarning:
Pyarrow will become a required dependency of pandas in the next major release of pandas (pandas 3.0),
(to allow more performant data types, such as the Arrow string type, and better interoperability with other libraries)
but was not found to be installed on your system.
If this would cause problems for you,
please provide us feedback at https://github.com/pandas-dev/pandas/issues/54466

  import pandas as pd

In [2]:
pp = {'city' : ['Tripoli','Tripoli','Rome','Rome','Sydney', 'Sydney'],
'rank': ['1st','2nd','1st','2nd','1st', '2nd'],
'name' : ['Noureddin', 'Adam', 'Kevin', 'Rihana', 'Raghad', 'Mahdi'],
'score1' : [44,48,39,41,38,44],
'score2': [67,63,55,70,64,77],
}

df = pd.DataFrame(pp, columns=['city', 'rank', 'name', 'score1', 'score2'])
df

      city rank       name  score1  score2
0  Tripoli  1st  Noureddin      44      67
1  Tripoli  2nd       Adam      48      63
2     Rome  1st      Kevin      39      55
3     Rome  2nd     Rihana      41      70
4   Sydney  1st     Raghad      38      64
5   Sydney  2nd      Mahdi      44      77

In [5]:
# save without index with seperator char "\t"
df.to_csv('my_data.csv', index = False, sep='\t')

In [9]:
# speciy that separator is '\t
df1 = pd.read_csv('my_data.csv', sep='\t')
df1

      city rank       name  score1  score2
0  Tripoli  1st  Noureddin      44      67
1  Tripoli  2nd       Adam      48      63
2     Rome  1st      Kevin      39      55
3     Rome  2nd     Rihana      41      70
4   Sydney  1st     Raghad      38      64
5   Sydney  2nd      Mahdi      44      77